dbetz/ch559usbhost/USBHost.c
void pollHIDdevice()
{
	__xdata unsigned char s, i, len;
	for (i = 0; i < MAX_HID_DEVICES; i++)
	{
		if(hidDevices[i].usbDevice != NULL){
            PXHIDdevice hidDevice = &hidDevices[i];
            PXUSBdevice usbDevice = hidDevice->usbDevice;
            selectHubPort(usbDevice->RootHubIndex, usbDevice->DeviceAddress);
            s = hostTransfer( USB_PID_IN << 4 | hidDevice->endPoint & 0x7F, hidDevice->endPoint & 0x80 ? bUH_R_TOG | bUH_T_TOG : 0, 0 );
            if ( s == ERR_SUCCESS )
            {
                hidDevice->endPoint ^= 0x80;
                len = USB_RX_LEN;
                if ( len )
                {		
                    LED = !LED;
                    if (hidDevice->inHandler) {
                        (*hidDevice->inHandler)(hidDevice, RxBuffer, len);
                    }
                }
            }
		}
	}
}

void readInterface(PXUSB_ITF_DESCR interface)
{
	DEBUG_OUT("Interface %d\n", interface->bInterfaceNumber);
	DEBUG_OUT("  Class %d\n", interface->bInterfaceClass);
	DEBUG_OUT("  Sub Class %d\n", interface->bInterfaceSubClass);
	DEBUG_OUT("  Interface Protocol %d\n", interface->bInterfaceProtocol);
}

void readHIDInterface(PXUSB_ITF_DESCR interface, PXUSB_HID_DESCR descriptor)
{
	DEBUG_OUT("HID at Interface %d\n", interface->bInterfaceNumber);
	DEBUG_OUT("  USB %d.%d%d\n", (descriptor->bcdHIDH & 15), (descriptor->bcdHIDL >> 4), (descriptor->bcdHIDL & 15));
	DEBUG_OUT("  Country code 0x%02X\n", descriptor->bCountryCode);
	DEBUG_OUT("  TypeX 0x%02X\n", descriptor->bDescriptorTypeX);
}

void readEndpoint()
{
}

unsigned char initializeConnection(PXUSBdevice usbDevice)
{
	unsigned char s = ERR_SUCCESS, cfg;
    unsigned char rootHubIndex = usbDevice->RootHubIndex;
    
    s = getDeviceDescriptor(usbDevice);
                          
    if ( s == ERR_SUCCESS )
    {
        DEBUG_OUT_USB_BUFFER(receiveDataBuffer);
        s = setUsbAddress(usbDevice, NextAddr++);
        if ( s == ERR_SUCCESS )
        {
            s = getDeviceString(usbDevice);
            {
                DEBUG_OUT_USB_BUFFER(receiveDataBuffer);
                if(convertStringDescriptor(receiveDataBuffer, receiveDataBuffer, RECEIVE_BUFFER_LEN,rootHubIndex))
                {
                    DEBUG_OUT("Device String: %s\n", receiveDataBuffer);
                }
                s = getConfigurationDescriptor(usbDevice);
                if ( s == ERR_SUCCESS )
                {
                    sendProtocolMSG(MSG_TYPE_DEVICE_INFO, (receiveDataBuffer[2] + (receiveDataBuffer[3] << 8)), usbDevice->DeviceAddress, rootHubIndex+1, 0xAA, receiveDataBuffer);
                    unsigned short i, total;
                    unsigned char __xdata temp[512];
                    PXUSB_ITF_DESCR currentInterface = 0;
                    //DEBUG_OUT_USB_BUFFER(receiveDataBuffer);
                    for(i = 0; i < receiveDataBuffer[2] + (receiveDataBuffer[3] << 8); i++)
                    {
                        DEBUG_OUT("0x%02X ", (uint16_t)(receiveDataBuffer[i]));
                    }
                    DEBUG_OUT("\n");

                    cfg = ((PXUSB_CFG_DESCR)receiveDataBuffer)->bConfigurationValue;
                    DEBUG_OUT("Configuration value: %d\n", cfg);

                    usbDevice->InterfaceCount = ((PXUSB_CFG_DESCR_LONG)receiveDataBuffer)->cfg_descr.bNumInterfaces;
                    DEBUG_OUT("Interface count: %d\n", usbDevice->InterfaceCount);

                    s = setUsbConfig(usbDevice, cfg);
                    
                    //parse descriptors
                    total = ((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthL + (((PXUSB_CFG_DESCR)receiveDataBuffer)->wTotalLengthH << 8);
                    for(i = 0; i < total; i++)
                        temp[i] = receiveDataBuffer[i];
                    i = ((PXUSB_CFG_DESCR)receiveDataBuffer)->bLength;
                    while(i < total)
                    {
                        unsigned char __xdata *desc = &(temp[i]);
                        switch(desc[1])
                        {
                            case USB_DESCR_TYP_INTERF:
                                DEBUG_OUT("Interface descriptor found\n", desc[1]);
                                //DEBUG_OUT_USB_BUFFER(desc);
                                currentInterface = ((PXUSB_ITF_DESCR)desc);
                                readInterface(currentInterface);
                                if (currentInterface->bInterfaceClass == USB_DEV_CLASS_HUB) {
                                    hub_initialize(usbDevice);
                                }
                                break;
                            case USB_DESCR_TYP_ENDP:
                                DEBUG_OUT("Endpoint descriptor found: %d\n", desc[1]);
                                DEBUG_OUT_USB_BUFFER(desc);
                                if(currentInterface->bInterfaceClass == USB_DEV_CLASS_HID)
                                {
                                    PXUSB_ENDP_DESCR d = (PXUSB_ENDP_DESCR)desc;
                                    if(d->bEndpointAddress & 0x80){
                                        PXHIDdevice device = addHIDdevice(usbDevice, currentInterface->bInterfaceNumber, d->bEndpointAddress);
                                        device->inHandler = hid_inHandler;
                                        getHIDDeviceReport(device);
                                    }
                                }
                                else if(currentInterface->bInterfaceClass == USB_DEV_CLASS_HUB)
                                {
                                    PXUSB_ENDP_DESCR d = (PXUSB_ENDP_DESCR)desc;
                                    if(d->bEndpointAddress & 0x80){
                                        PXHIDdevice device = addHIDdevice(usbDevice, currentInterface->bInterfaceNumber, d->bEndpointAddress);
                                        device->inHandler = hub_inHandler;
                                    }
                                    DEBUG_OUT("Found HUB %s endpoint: 0x%02x\n", (d->bEndpointAddress & USB_ENDP_DIR_MASK) ? "IN" : "OUT", d->bEndpointAddress);
                                }
                                else if (ftdi_check(usbDevice))
                                {
                                    PXUSB_ENDP_DESCR d = (PXUSB_ENDP_DESCR)desc;
                                    if(d->bEndpointAddress & 0x80){
                                        PXHIDdevice device = addHIDdevice(usbDevice, currentInterface->bInterfaceNumber, d->bEndpointAddress);
                                        device->inHandler = ftdi_inHandler;
                                    }
                                    DEBUG_OUT("Found FT232 %s endpoint: 0x%02x\n", (d->bEndpointAddress & USB_ENDP_DIR_MASK) ? "IN" : "OUT", d->bEndpointAddress);
                                }
                                break;
                            case USB_DESCR_TYP_HID:
                                DEBUG_OUT("HID descriptor found\n", desc[1]);
                                //DEBUG_OUT_USB_BUFFER(desc);
                                if(currentInterface == 0) break;
                                readHIDInterface(currentInterface, (PXUSB_HID_DESCR)desc);
                                break;
                            case USB_DESCR_TYP_CS_INTF:
                                DEBUG_OUT("Class specific header descriptor found\n", desc[1]);
                                DEBUG_OUT_USB_BUFFER(desc);
                                //if(currentInterface == 0) break;
                                //readHIDInterface(currentInterface, (PXUSB_HID_DESCR)desc);
                                break;
                            case USB_DESCR_TYP_CS_ENDP:
                                DEBUG_OUT("Class specific endpoint descriptor found\n", desc[1]);
                                DEBUG_OUT_USB_BUFFER(desc);
                                //if(currentInterface == 0) break;
                                //readHIDInterface(currentInterface, (PXUSB_HID_DESCR)desc);
                                break;
                            default:
                                DEBUG_OUT("Unexpected descriptor type: %02X\n", desc[1]);
                                DEBUG_OUT_USB_BUFFER(desc);
                        }
                        i += desc[0];
                    }
                    
                    if (ftdi_check(usbDevice)) {
                        ftdi_initialize(usbDevice);
                    }
                    else if (usbDevice->DeviceClass == USB_DEV_CLASS_HUB) {
                        hub_initialize(usbDevice);
                    }
                    
                    return ERR_SUCCESS;
                }			
            }
        }
    }
    return s;
}

unsigned char initializeRootHubConnection(unsigned char rootHubIndex)
{
	unsigned char retry, i, s = ERR_SUCCESS;
	unsigned char HIDDevice = 0;
    PXUSBdevice usbDevice = addUSBdevice(rootHubIndex);

	for(retry = 0; retry < 10; retry++) //todo test fewer retries
	{
	delay( 100 );
		delay(100); //todo test lower delay
        resetRootHubPort(rootHubIndex);                      
		for (i = 0; i < 100; i++) //todo test fewer retries
		{
			delay(1);
			if (enableRootHubPort(rootHubIndex) == ERR_SUCCESS)  
				break;
		}
		if (i == 100)                                              
		{
			disableRootHubPort(rootHubIndex);
			DEBUG_OUT("Failed to enable root hub port %i\n", rootHubIndex);
			continue;
		}

        s = initializeConnection(usbDevice);
        if (s == ERR_SUCCESS) {
            return s;
        }
        
		DEBUG_OUT( "Error = %02X\n", s);
		sendProtocolMSG(MSG_TYPE_ERROR,0, rootHubIndex+1, s, 0xEE, 0);
		rootHubDevice[rootHubIndex].status = ROOT_DEVICE_FAILED;
		setUsbSpeed(1);	//TODO define speeds
	}
	return s;
}

unsigned char checkRootHubConnections()
{
	unsigned char s;
	s = ERR_SUCCESS;
	if (UIF_DETECT)                                                        
	{
		UIF_DETECT = 0;    
			if(USB_HUB_ST & bUHS_H0_ATTACH)
			{
				if(rootHubDevice[0].status == ROOT_DEVICE_DISCONNECT || (UHUB0_CTRL & bUH_PORT_EN) == 0x00)
				{
					disableRootHubPort(0);	//todo really need to reset register?
					rootHubDevice[0].status = ROOT_DEVICE_CONNECTED;
					DEBUG_OUT("Device at root hub %i connected\n", 0);
					sendProtocolMSG(MSG_TYPE_CONNECTED,0, 0x01, 0x01, 0x01, 0);
					s = initializeRootHubConnection(0);
				}
			}
			else
			if(rootHubDevice[0].status >= ROOT_DEVICE_CONNECTED)
			{
    			resetHubDevices(0);
				disableRootHubPort(0);
				DEBUG_OUT("Device at root hub %i disconnected\n", 0);
					sendProtocolMSG(MSG_TYPE_DISCONNECTED,0, 0x01, 0x01, 0x01, 0);
				s = ERR_USB_DISCON;
			}
			if(USB_HUB_ST & bUHS_H1_ATTACH)
			{
				
				if(rootHubDevice[1].status == ROOT_DEVICE_DISCONNECT || (UHUB1_CTRL & bUH_PORT_EN) == 0x00)
				{
					disableRootHubPort(1);	//todo really need to reset register?
					rootHubDevice[1].status = ROOT_DEVICE_CONNECTED;
					DEBUG_OUT("Device at root hub %i connected\n", 1);
					sendProtocolMSG(MSG_TYPE_CONNECTED,0, 0x02, 0x02, 0x02, 0);
					s = initializeRootHubConnection(1);
				}
			}
			else
			if(rootHubDevice[1].status >= ROOT_DEVICE_CONNECTED)
			{
    			resetHubDevices(1);
				disableRootHubPort(1);
				DEBUG_OUT("Device at root hub %i disconnected\n", 1);
					sendProtocolMSG(MSG_TYPE_DISCONNECTED,0, 0x02, 0x02, 0x02, 0);
				s = ERR_USB_DISCON;
			}
	}
	return s;
}